In [1]:
import pandas as pd

In [4]:
'l1 l2 l3 l4'.split()
# Parecido com list, utilizando espa√ßamentos

['l1', 'l2', 'l3', 'l4']

In [5]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [6]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [8]:
type(df['c1'])

pandas.core.series.Series

In [9]:
df[['c1', 'c2']]

    c1  c2
l1   1   2
l2   5   6
l3   8  10
l4  13  14

In [10]:
type(df[['c1', 'c2']])

pandas.core.frame.DataFrame

In [11]:
df[:]
# Todas as linhas

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [14]:
df[1:]
# A partir da linha 1

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [15]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [16]:
df[1:][['c1', 'c2']]
# Sele√ß√£o de linhas e colunas

    c1  c2
l2   5   6
l3   8  10
l4  13  14

In [17]:
df.loc['l3']
# Sele√ß√£o de linhas pelos r√≥tulos

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [19]:
df.loc[['l3', 'l2']]
# Sele√ß√£o de linhas pelos r√≥tulos (duas)

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [22]:
df.loc['l1', 'c2']
# Sele√ß√£o de linhas/colunas pelos r√≥tulos

2

In [24]:
df.iloc[0, 1]
# Sele√ß√£o de linhas/colunas numericamente

2

In [26]:
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   8
l1   4   1

In [27]:
df.iloc[[2,0], [3,0]]

    c4  c1
l3  12   8
l1   4   1